<a href="https://colab.research.google.com/github/aimanuel/JupyterNotebook/blob/main/1_JoinType.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd

In [ ]:
from google.colab import drive
drive.mount('/content/drive')

Mounted at /content/drive

In [ ]:
file_left = "/content/drive/MyDrive/13. Python/Machine Learning/JoinType/LeftSide.csv"
file_right = "/content/drive/MyDrive/13. Python/Machine Learning/JoinType/RightSide.csv"

In [ ]:
left_df = pd.read_csv(file_left)
right_df = pd.read_csv(file_right)

In [ ]:
left_df

   ID  Data
0   1  asdf
1   2  qwer
2   3  zxcv
3   4  uiop
4   5  hjkl
5   6  vbnm

In [ ]:
right_df

   ID DataRight
0   5      hjkl
1   6      vbnm
2   7      poiu
3   8      ytre
4   9      kjhg
5  10      bvcx

# Inner Join

In [ ]:
pd.merge(left_df,right_df,how='inner')

   ID  Data DataRight
0   5  hjkl      hjkl
1   6  vbnm      vbnm

# Left Join

In [ ]:
pd.merge(left_df,right_df,how='left')

   ID  Data DataRight
0   1  asdf       NaN
1   2  qwer       NaN
2   3  zxcv       NaN
3   4  uiop       NaN
4   5  hjkl      hjkl
5   6  vbnm      vbnm

# Right Join

In [ ]:
pd.merge(left_df,right_df,how='right')

   ID  Data DataRight
0   5  hjkl      hjkl
1   6  vbnm      vbnm
2   7   NaN      poiu
3   8   NaN      ytre
4   9   NaN      kjhg
5  10   NaN      bvcx

# Outer Join

In [ ]:
pd.merge(left_df,right_df,how='outer',indicator=True)

   ID  Data DataRight      _merge
0   1  asdf       NaN   left_only
1   2  qwer       NaN   left_only
2   3  zxcv       NaN   left_only
3   4  uiop       NaN   left_only
4   5  hjkl      hjkl        both
5   6  vbnm      vbnm        both
6   7   NaN      poiu  right_only
7   8   NaN      ytre  right_only
8   9   NaN      kjhg  right_only
9  10   NaN      bvcx  right_only

# Outer Left Only

source : https://stackoverflow.com/questions/50543326/how-to-do-left-outer-join-exclusion-in-pandas

In [ ]:
pd.merge(left_df, right_df, how="outer", indicator=True).query('_merge=="left_only"')

   ID  Data DataRight     _merge
0   1  asdf       NaN  left_only
1   2  qwer       NaN  left_only
2   3  zxcv       NaN  left_only
3   4  uiop       NaN  left_only

# Outer Right Only

In [ ]:
pd.merge(left_df, right_df, how="outer", indicator=True).query('_merge=="right_only"')

   ID Data DataRight      _merge
6   7  NaN      poiu  right_only
7   8  NaN      ytre  right_only
8   9  NaN      kjhg  right_only
9  10  NaN      bvcx  right_only